# Задание 3
m = float(input('введите m'))
for i in range(1, 11):
    print (m*i)

